/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_split.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fngoc <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/31 15:42:46 by fngoc             #+#    #+#             */
/*   Updated: 2020/10/31 15:42:48 by fngoc            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//#include "libft.h"
//
///*
//** ft_split: Выделяет и возвращает массив строк,
//** полученных путем разделения 's' с помощью
//** символ ’c’ в качестве разделителя.
//** Массив должен быть заканчивается указателем NULL.
//*/
//
//int why_ch(char *s, char c);
//
//char **ft_split(char *s, char c)
//{
//	char **p;
//	int mass;
//	int i;
//	int j;
//	int tmp;
//
//	i = 0;
//	tmp = 0;
//	j = 0;
//	mass = why_ch(s, c);
//	*p[mass];
//	while (s[i] == '\0')
//	{
//		if (s[i] == c)
//		{
//			++tmp;
//			j = 0;
//		}
//		p[tmp][j] = s[i];
//		++j;
//		++i;
//	}
//	p[++tmp] = NULL;
//	return (p);
//}
//
//int why_ch(char *s, char c)
//{
//	int i;
//	int result;
//
//	i = 0;
//	result = 0;
//	while (s[i] != '\0')
//	{
//		if (s[i] == c)
//			++result;
//	}
//	return (result);
//}
